rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
APP_TIMER_DEF(m_our_char_timer_id);
APP_TIMER_DEF(m_battery_timer_id);                                                /**< Battery measurement timer. */
APP_TIMER_DEF(m_battery_frequency_id);                                                /**< Battery measurement timer. */
//APP_TIMER_DEF(m_notification_timer_id);
NRF_BLE_GATT_DEF(m_gatt);                                                         /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                           /**< Context for the Queued Write module.*/
BLE_BAS_DEF(m_bas);                                                               /**< Battery service instance. */
BLE_ADVERTISING_DEF(m_advertising);                                               /**< Advertising module instance. */
BLE_CUS_DEF(m_cus);                                                               /**< Context for the Queued Write module.*/
BLE_OPT_DEF(m_opt);                                                               /**< Context for the Queued Write module.*/

static uint16_t           m_conn_handle = BLE_CONN_HANDLE_INVALID;                          /**< Handle of the current connection. */
static pm_peer_id_t       m_peer_id;                                               /**< Device reference handle to the current bonded central. */
static bool               m_in_boot_mode = false;                                  /**< Current protocol mode. */
static uint8_t            m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                     /**< Advertising handle used to identify an advertising set. */
static uint8_t            m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                      /**< Buffer for storing an encoded advertising set. */
static uint8_t            m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];           /**< Buffer for storing an encoded scan data. */

static nrf_saadc_value_t adc_buf[2];
static uint32_t watering_duration =  0;                                      
//static uint8_t m_custom_value = 0;
static uint8_t pm_paired = 0;
//Step 5: Declare variable holding our service UUID
static ble_uuid_t m_adv_uuids[] = {{CUSTOM_SERVICE_UUID,BLE_UUID_TYPE_VENDOR_BEGIN}};

static void advertising_start(bool erase_bonds);
static void on_bas_evt(ble_bas_t * p_bas, ble_bas_evt_t * p_evt);

static void tap_notification_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
    ret_code_t err_code;
   
    err_code = ble_cus_custom_value_update(&m_cus);
    APP_ERROR_CHECK(err_code);
}

void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for setting filtered whitelist.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void whitelist_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];
    uint32_t     peer_id_count = BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);
    SEGGER_RTT_printf(0,"m_whitelist_peer_cnt %d, MAX_PEERS_WLIST %d\n", peer_id_count + 1, BLE_GAP_WHITELIST_ADDR_MAX_COUNT);
   
    err_code = pm_whitelist_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);

    SEGGER_RTT_printf(0,"m_whitelist_peers %s", peer_ids[0]);
}

/**@brief Function for handling Service errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in] nrf_error   Error code containing information about what went wrong.
 */
static void service_error_handler(uint32_t nrf_error)
{
    //NRF_LOG_INFO(nrf_error);
    SEGGER_RTT_WriteString(0, " the nrf error is: " + nrf_error);
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling advertising errors.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
static void ble_advertising_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the ADC interrupt.
 *
 * @details  This function will fetch the conversion result from the ADC, convert the value into
 *           percentage and send it to peer.
 */
void saadc_event_handler(nrf_drv_saadc_evt_t const * p_event)
{
    if (p_event->type == NRF_DRV_SAADC_EVT_DONE)
    {
        nrf_saadc_value_t adc_result;
        uint16_t          batt_lvl_in_milli_volts;
        uint8_t           percentage_batt_lvl;
        uint32_t          err_code;

        adc_result = p_event->data.done.p_buffer[0];

        err_code = nrf_drv_saadc_buffer_convert(p_event->data.done.p_buffer, 1);
        APP_ERROR_CHECK(err_code);

        batt_lvl_in_milli_volts = ADC_RESULT_IN_MILLI_VOLTS(adc_result) +
                                  DIODE_FWD_VOLT_DROP_MILLIVOLTS;
        percentage_batt_lvl = battery_level_in_percent(batt_lvl_in_milli_volts);
        SEGGER_RTT_printf(0,"the battery level in percent is: %d\n", percentage_batt_lvl);
        err_code = ble_bas_battery_level_update(&m_bas, percentage_batt_lvl, BLE_CONN_HANDLE_ALL);
        if ((err_code != NRF_SUCCESS) &&
            (err_code != NRF_ERROR_INVALID_STATE) &&
            (err_code != NRF_ERROR_RESOURCES) &&
            (err_code != NRF_ERROR_BUSY) &&
            (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
           )
        {
            APP_ERROR_HANDLER(err_code);
        }
    }
    nrf_drv_saadc_uninit();
    NRF_SAADC->INTENCLR = (SAADC_INTENCLR_END_Clear << SAADC_INTENCLR_END_Pos);
    NVIC_ClearPendingIRQ(SAADC_IRQn);
}

/**@brief Function for configuring ADC to do battery level conversion.
 */
static void adc_configure(void)
{
    ret_code_t err_code = nrf_drv_saadc_init(NULL, saadc_event_handler);
    APP_ERROR_CHECK(err_code);

    nrf_saadc_channel_config_t config =
        NRF_DRV_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_VDD);
    err_code = nrf_drv_saadc_channel_init(0, &config);
    APP_ERROR_CHECK(err_code);

