rowdy15/battery-powered-ble-irrigation-controller-project-with-the-nRF52832/main.c
    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[0], 1);
    APP_ERROR_CHECK(err_code);

    err_code = nrf_drv_saadc_buffer_convert(&adc_buf[1], 1);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the Battery measurement timer timeout.
 *
 * @details This function will be called each time the battery level measurement timer expires.
 *          This function will start the ADC.
 *
 * @param[in] p_context   Pointer used for passing some arbitrary information (context) from the
 *                        app_start_timer() call to the timeout handler.
 */
static void battery_level_meas_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code;
    adc_configure();
    err_code = nrf_drv_saadc_sample();
    APP_ERROR_CHECK(err_code);
}

static void notifyOfFrequencyChange(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    ret_code_t err_code;
    err_code = ble_opt_notify_client(&m_opt);
    APP_ERROR_CHECK(err_code);
}



/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function for handling the Battery Service events.
 *
 * @details This function will be called for all Battery Service events which are passed to the
 |          application.
 *
 * @param[in] p_bas  Battery Service structure.
 * @param[in] p_evt  Event received from the Battery Service.
 */
static void on_bas_evt(ble_bas_t * p_bas, ble_bas_evt_t * p_evt)
{
    ret_code_t err_code;

    switch (p_evt->evt_type)
    {
        case BLE_BAS_EVT_NOTIFICATION_ENABLED:
            // Start battery timer
            SEGGER_RTT_WriteString(0,"the battery service has been notify enabled\n");
            err_code = app_timer_start(m_battery_timer_id, BATTERY_LEVEL_MEAS_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            break; // BLE_BAS_EVT_NOTIFICATION_ENABLED

        case BLE_BAS_EVT_NOTIFICATION_DISABLED:
            SEGGER_RTT_WriteString(0,"the battery service has been notify disabled\n");
            err_code = app_timer_stop(m_battery_timer_id);
            APP_ERROR_CHECK(err_code);
            break; // BLE_BAS_EVT_NOTIFICATION_DISABLED

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_cus_evt(ble_cus_t * p_cus_service, ble_cus_evt_t * p_evt)
{
    ret_code_t err_code;
    
    switch(p_evt->evt_type)
    {
        case BLE_CUS_EVT_NOTIFICATION_ENABLED:
            err_code = app_timer_start(m_our_char_timer_id, CUSTOM_SERVICE_NOTIFICATION_INTERVAL, NULL);
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"the custom service has been notify enabled\n");
            break;

        case BLE_CUS_EVT_NOTIFICATION_DISABLED:
            SEGGER_RTT_WriteString(0,"the custom service has been notify disabled\n");
            err_code = app_timer_stop(m_our_char_timer_id);
            APP_ERROR_CHECK(err_code);                        
            break;

        case BLE_CUS_EVT_CONNECTED:
            break;

        case BLE_CUS_EVT_DISCONNECTED:
//            SEGGER_RTT_WriteString(0,"if tap timer is on then then this will turn it off on disconnection of esp32\n");
//            err_code = app_timer_stop(m_our_char_timer_id);
//            APP_ERROR_CHECK(err_code); 
              break;

        default:
              // No implementation needed.
              break;
    }
}

/**@brief Function for handling the Custom Service Service events.
 *
 * @details This function will be called for all Custom Service events which are passed to
 *          the application.
 *
 * @param[in]   p_cus_service  Custom Service structure.
 * @param[in]   p_evt          Event received from the Custom Service.
 *
 */
static void on_opt_evt(ble_option_t * p_opt_service, ble_opt_evt_t * p_evt)
{
    ret_code_t err_code;
    
    switch(p_evt->evt_type)
    {
        case BLE_CUS_EVT_NOTIFICATION_ENABLED:
            err_code = app_timer_start(m_battery_frequency_id, 1000, NULL);  //notify in 1 second
            APP_ERROR_CHECK(err_code);
            SEGGER_RTT_WriteString(0,"the Battery Frequency (option) service has been notify enabled\n");
            break;

        case BLE_CUS_EVT_NOTIFICATION_DISABLED:
            SEGGER_RTT_WriteString(0,"the option service has been notify disabled\n");
            err_code = app_timer_stop(m_battery_frequency_id);
            APP_ERROR_CHECK(err_code);                        
            break;
        case BLE_OPT_BAT_CHECK_1_MIN:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(60000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 1 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_10_MIN:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(600000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 10 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_30_MIN:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(180000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 30 min!\n");
            break;
        case BLE_OPT_BAT_CHECK_1_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(3600000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 1 hour!\n");
            break;
        case BLE_OPT_BAT_CHECK_6_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(21600000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 6 hours!\n");
            break;
        case BLE_OPT_BAT_CHECK_12_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(43200000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 12 hours!\n");
            break;
        case BLE_OPT_BAT_CHECK_24_HR:
            BATTERY_LEVEL_MEAS_INTERVAL  =  APP_TIMER_TICKS(86400000);
            SEGGER_RTT_WriteString(0,"battery read frequency was changed to 24 hours!\n");
            break;
        case BLE_OPT_EVT_CONNECTED:
            break;

        case BLE_OPT_EVT_DISCONNECTED:
              break;
        default:
              // No implementation needed.
              break;
    }
}

/**@brief Function for setting filtered device identities.
 *
 * @param[in] skip  Filter passed to @ref pm_peer_id_list.
 */
static void identities_set(pm_peer_id_list_skip_t skip)
{
    pm_peer_id_t peer_ids[BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT];
    uint32_t     peer_id_count = BLE_GAP_DEVICE_IDENTITIES_MAX_COUNT;

    ret_code_t err_code = pm_peer_id_list(peer_ids, &peer_id_count, PM_PEER_ID_INVALID, skip);
    APP_ERROR_CHECK(err_code);

    err_code = pm_device_identities_list_set(peer_ids, peer_id_count);
    APP_ERROR_CHECK(err_code);
}

/**@brief Clear bond information from persistent storage.
 */
static void delete_bonds(void)
{
    ret_code_t err_code;
    SEGGER_RTT_WriteString(0,"Erasing Bonds!.\n");
    //NRF_LOG_INFO("Erase bonds!");

    err_code = pm_peers_delete();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for starting advertising.
 */
static void advertising_start(bool erase_bonds)
{
    if (erase_bonds == true)
    {
        delete_bonds();
        // Advertising is started by PM_EVT_PEERS_DELETE_SUCCEEDED event.
    }
    else
    {
        whitelist_set(PM_PEER_ID_LIST_SKIP_NO_ID_ADDR);

